performance/tests/stockCardLineItemReasonTag.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: get-tags

scenarios:
  get-tags:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/stockCardLineItemReasonTags
        method: GET
        label: GetTags
        headers:
          Authorization: Bearer ${access_token}

reporting:
    - module: passfail
      criteria:
        Get Tags too slow: p90 of GetTags>200ms