performance/tests/stockCardRangeSummaries.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: get-stock-card-range-summaries

scenarios:
  get-stock-card-range-summaries:
    variables:
      # Depósito Distrital Cuamba
      facility_id: c62dea9b-6974-4101-ba39-b09914165967
      # EPI
      program_id: 418bdc1d-c303-4bd0-b2d3-d8901150a983
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/stockCardRangeSummaries?facilityId=${facility_id}&programId=${program_id}
        method: GET
        label: GetStockCardRangeSummaries
        headers:
          Authorization: Bearer ${access_token}

reporting:
    - module: passfail
      criteria:
        Get Stock Card Range Summaries too slow: p90 of GetStockCardRangeSummaries>90000ms