performance/tests/stockCardRangeSummaries.yml
execution:
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-stock-card-range-summaries

scenarios:
  get-stock-card-range-summaries:
    variables:
      # Depósito Distrital Cuamba
      facility_id: c62dea9b-6974-4101-ba39-b09914165967
      # EPI
      program_id: 418bdc1d-c303-4bd0-b2d3-d8901150a983
      start_date: 2017-01-01
      end_date: 2019-12-01
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/stockCardRangeSummaries?facilityId=${facility_id}&programId=${program_id}&startDate=${start_date}&endDate=${end_date}
        method: GET
        label: GetStockCardRangeSummaries
        headers:
          Authorization: Bearer ${access_token}

reporting:
  - module: passfail
    criteria:
      - 'GetStockCardRangeSummaries too high error rate: failures>1%, continue as failed, label=GetStockCardRangeSummaries, title="GetStockCardRangeSummaries error rate too high"'
      - 'GetStockCardRangeSummaries is too slow: p90>2500ms, stop as failed, label=GetStockCardRangeSummaries, title="GetStockCardRangeSummaries response time too high"'
      - 'GetStockCardRangeSummaries needs improvement: p90>1500ms and p90<=2500ms, continue as passed, label=GetStockCardRangeSummaries, title="GetStockCardRangeSummaries needs improvement"'