performance/tests/stockCardSummaries.yml
execution:
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-stock-card-summaries-v2

scenarios:
  get-stock-card-summaries-v2:
    variables:
      # Comfort Health Clinic
      facility_id: e6799d64-d10d-4011-b8c2-0e4d4a3f65ce
      # Essential Meds
      program_id: 10845cb9-d365-4aaa-badd-b4fa39c6a26a
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/v2/stockCardSummaries?facilityId=${facility_id}&programId=${program_id}
        method: GET
        label: GetStockCardSummariesV2
        headers:
          Authorization: Bearer ${access_token}

reporting:
  - module: passfail
    criteria:
      - 'GetStockCardSummariesV2 too high error rate: failures>1%, continue as failed, label=GetStockCardSummariesV2, title="GetStockCardSummariesV2 error rate too high"'
      - 'GetStockCardSummariesV2 is too slow: p90>2500ms, stop as failed, label=GetStockCardSummariesV2, title="GetStockCardSummariesV2 response time too high"'
      - 'GetStockCardSummariesV2 needs improvement: p90>1500ms and p90<=2500ms, continue as passed, label=GetStockCardSummariesV2, title="GetStockCardSummariesV2 needs improvement"'